maincases/drag_400/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

solvers
{
    "(p|pa).*"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-9;
        relTol           0.01;
    };

    "(m|ma)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-9;
        relTol           0.01;
    };

    "(U|Ua).*"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-9;
        relTol           0.1;
    }
}

relaxationFactors
{
    fields
    {
        "p.*"    0.3;
        "pa.*"   0.3;
    }
    equations
    {
        "U.*"    0.7;
        "Ua.*"   0.7;
    }
}


// ************************************************************************* //
